# Core CLI tools
brew "bat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zoxide"

# Zsh plugins (Homebrew-managed)
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Go development
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "air"
brew "protobuf"
brew "grpcurl"
brew "glslang"

# AWS / Cloud
brew "awscli"

# Kubernetes / Containers
brew "k9s"
brew "helm"
brew "stern"
brew "kubectx"
brew "colima"
brew "docker"
brew "dive"
brew "lazydocker"

# Utilities
brew "yq"
brew "httpie"
brew "tmux"
brew "tree"
brew "watch"
brew "lazygit"

# Desktop rice
tap "FelixKratz/formulae"
tap "nikitabobko/tap"
brew "FelixKratz/formulae/sketchybar"
brew "FelixKratz/formulae/borders"
brew "btop"
brew "cava"
brew "glow"

# File manager + preview deps
brew "yazi"
brew "ffmpegthumbnailer"
brew "unar"
brew "poppler"

# Shader / visual-effects tools
tap "tattoy-org/tap"
brew "tattoy-org/tap/tattoy"          # text compositor — runs Shadertoy shaders in any terminal
# RetroVisor: CRT shader overlay for any macOS window (not on Homebrew)
# Download from: https://github.com/dirkwhoffmann/RetroVisor/releases

# Terminal fun / hacker aesthetic
brew "pipes-sh"
brew "cbonsai"
brew "tty-clock"
brew "lolcat"
brew "figlet"
brew "toilet"
brew "cowsay"
brew "fortune"
brew "cmatrix"
brew "onefetch"
brew "terminal-notifier"

# Casks
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "1password-cli"
