# Core CLI tools
brew "bat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zoxide"

# Zsh plugins (Homebrew-managed)
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Go development
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "air"
brew "protobuf"
brew "grpcurl"

# AWS / Cloud
brew "awscli"

# Kubernetes / Containers
brew "k9s"
brew "helm"
brew "stern"
brew "kubectx"
brew "colima"
brew "docker"
brew "dive"
brew "lazydocker"

# Utilities
brew "yq"
brew "httpie"
brew "tmux"
brew "tree"
brew "watch"
brew "lazygit"

# Casks
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
cask "1password-cli"
