# Core CLI tools
brew "bat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zoxide"

# Zsh plugins (Homebrew-managed)
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
