# AFTRS Shell - Antidote Plugin Configuration
# This file defines plugins that antidote will load

# Oh-My-Zsh compatibility layer
aftrs-shell/use-omz

# Essential oh-my-zsh plugins via use-omz
use-omz ohmyzsh/ohmyzsh plugins/git
use-omz ohmyzsh/ohmyzsh plugins/colored-man-pages
use-omz ohmyzsh/ohmyzsh plugins/command-not-found
use-omz ohmyzsh/ohmyzsh plugins/common-aliases
use-omz ohmyzsh/ohmyzsh plugins/sudo
use-omz ohmyzsh/ohmyzsh plugins/extract

# Syntax highlighting and autosuggestions (must be loaded in this order)
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions

# Completions
zsh-users/zsh-completions

# History search
zsh-users/zsh-history-substring-search

# Theme - Pure prompt
sindresorhus/pure

# Directory navigation
rupa/z

# Enhanced cd with interactive selection
b4b4r07/enhancd

# FZF integration
unixorn/fzf-zsh-plugin

# Docker completions
docker/cli contrib/completion/zsh

# Additional useful plugins
hlissner/zsh-autopair
MichaelAquilina/zsh-you-should-use
agkozak/zsh-z
